//=============================================================================
//
// モデル [model.h]
// Author : 三橋錬
//
//=============================================================================
#ifndef _MODEL_H_
#define _MODEL_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "scene3D.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CModel : virtual public CScene3D
{
public:
	CModel(CScene::PRIORITY nPriority = PRIORITY_NONE);
	~CModel();

	//HRESULT Init(void);
	//void Uninit(void);
	//void Update(void);
	//void Draw(void);

private:

};

#endif