//=============================================================================
//
// 数字 [number.cpp]
// Author : 三橋錬
//
//=============================================================================
#include "number.h"
#include "manager.h"
#include "renderer.h"
#include "texture.h"
#include "scene2D.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CNumber::CNumber(CScene::PRIORITY nPriority) : CScene2D(nPriority)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CNumber::~CNumber()
{

}

//=============================================================================
// ポリゴンの初期化処理
//=============================================================================
HRESULT CNumber::Init(D3DXVECTOR3 pos, D3DXVECTOR3 size, LPDIRECT3DTEXTURE9 tex)
{
	SetPos(pos);
	SetSize(size);
	SetDeath(false);

	CScene2D::Init(tex);

	return S_OK;
}

//=============================================================================
// ポリゴンの終了処理
//=============================================================================
void CNumber::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
// ポリゴンの更新処理
//=============================================================================
void CNumber::Update(void)
{

}

//=============================================================================
// ポリゴンの描画処理
//=============================================================================
void CNumber::Draw(void)
{
	CScene2D::Draw();
}

CNumber *CNumber::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, LPDIRECT3DTEXTURE9 tex)
{
	CNumber* pNumber = new CNumber;

	if (pNumber != NULL)
	{
		pNumber->Init(pos, size, tex);
	}
	return pNumber;
}