//=============================================================================
//
// 板ポリゴン [objectbg.cpp]
// Author : 三橋錬
//
//=============================================================================
#include "objectbg.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CObjectBg::CObjectBg(CScene::PRIORITY nPriority) : CScene2D(nPriority)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CObjectBg::~CObjectBg()
{

}

//=============================================================================
// ポリゴンの初期化処理
//=============================================================================
HRESULT CObjectBg::Init(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXVECTOR3 size, LPDIRECT3DTEXTURE9 tex)
{
	SetPos(pos);
	SetMove(move);
	SetSize(size);
	SetDeath(false);

	CScene2D::Init(tex);

	return S_OK;
}

//=============================================================================
// ポリゴンの終了処理
//=============================================================================
void CObjectBg::Uninit()
{
	CScene2D::Uninit();
}

//=============================================================================
// ポリゴンの更新処理
//=============================================================================
void CObjectBg::Update()
{
	SetPositionCenter(GetPos(), GetSize());
}

//=============================================================================
// ポリゴンの描画処理
//=============================================================================
void CObjectBg::Draw()
{
	CScene2D::Draw();
}

CObjectBg *CObjectBg::Create(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXVECTOR3 size, LPDIRECT3DTEXTURE9 tex)
{
	CObjectBg* pBg = new CObjectBg;

	if (pBg != NULL)
	{
		pBg->Init(pos, move, size, tex);
	}
	return pBg;
}