//=============================================================================
//
// ”wŒi‚Ì˜f¯ [planet.cpp]
// Author : ŽO‹´˜B
//
//=============================================================================
#include "planet.h"
#include "manager.h"
#include "renderer.h"

#include "fade.h"

//=============================================================================
// ƒRƒ“ƒXƒgƒ‰ƒNƒ^
//=============================================================================
CPlanet::CPlanet(CScene::PRIORITY nPriority) : CScene3D(nPriority)
{

}

//=============================================================================
// ƒfƒXƒgƒ‰ƒNƒ^
//=============================================================================
CPlanet::~CPlanet()
{

}

//=============================================================================
// ƒ|ƒŠƒSƒ“‚Ì‰Šú‰»ˆ—
//=============================================================================
HRESULT CPlanet::Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot, LPDIRECT3DTEXTURE9 tex)
{
	SetPos(pos);
	SetRot(rot);

	CScene3D::Init(tex);

	SetDeath(false);

	Load("data\\model\\planet.x");

	return S_OK;
}

//=============================================================================
// ƒ|ƒŠƒSƒ“‚ÌI—¹ˆ—
//=============================================================================
void CPlanet::Uninit()
{
	CScene3D::Uninit();
}

//=============================================================================
// ƒ|ƒŠƒSƒ“‚ÌXVˆ—
//=============================================================================
void CPlanet::Update()
{
	SetRot(GetRot() + D3DXVECTOR3(-0.001f, 0.001f, 0.0f));

	CScene3D::Update();
}

//=============================================================================
// ƒ|ƒŠƒSƒ“‚Ì•`‰æˆ—
//=============================================================================
void CPlanet::Draw()
{
	CScene3D::Draw();
}

CPlanet *CPlanet::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, LPDIRECT3DTEXTURE9 tex)
{
	CPlanet* pPlanet = new CPlanet;

	if (pPlanet != NULL)
	{
		pPlanet->Init(pos, rot, tex);
	}

	return pPlanet;
}