//=============================================================================
//
// 板ポリゴン [screenbg.cpp]
// Author : 三橋錬
//
//=============================================================================
#include "screenbg.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CScreenBg::CScreenBg(CScene::PRIORITY nPriority) : CScene2D(nPriority)
{

}

//=============================================================================
// デストラクタ
//=============================================================================
CScreenBg::~CScreenBg()
{

}

//=============================================================================
// ポリゴンの初期化処理
//=============================================================================
HRESULT CScreenBg::Init(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXVECTOR3 size, LPDIRECT3DTEXTURE9 tex)
{
	SetPos(pos);
	SetMove(move);
	SetSize(size);
	SetDeath(false);

	CScene2D::Init(tex);

	return S_OK;
}

//=============================================================================
// ポリゴンの終了処理
//=============================================================================
void CScreenBg::Uninit()
{
	CScene2D::Uninit();
}

//=============================================================================
// ポリゴンの更新処理
//=============================================================================
void CScreenBg::Update()
{
	SetPositionCenter(GetPos(), GetSize());
}

//=============================================================================
// ポリゴンの描画処理
//=============================================================================
void CScreenBg::Draw()
{
	CScene2D::Draw();
}

CScreenBg *CScreenBg::Create(D3DXVECTOR3 pos, D3DXVECTOR3 move, D3DXVECTOR3 size, LPDIRECT3DTEXTURE9 tex)
{
	CScreenBg* pBg = new CScreenBg;

	if (pBg != NULL)
	{
		pBg->Init(pos, move, size, tex);
	}
	return pBg;
}