//=============================================================================
//
// ステージビルダーシーン [stagebuild.h]
// Author : 三橋錬
//
//=============================================================================
#ifndef _STAGEBUILD_H_
#define _STAGEBUILD_H_

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CCursor;

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "stageload.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CStageBuild : public CManager, public CStageLoad
{
public:
	CStageBuild();
	~CStageBuild();

	HRESULT Init();
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CCursor				*GetCursor()	{ return m_pCursor; }

private:
	static CCursor				*m_pCursor;		// カーソルに追従するポリゴンのクラス
};

#endif