//=============================================================================
//
// クリアタイム [tme.h]
// Author : 三橋錬
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TIME_DIGITS (3)

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CUIBg;

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "number.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTime : public CScene2D
{
public:
	CTime(CScene::PRIORITY nPriority = PRIORITY_UI);
	~CTime();

	HRESULT Init(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTime *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);

	static CUIBg *GetUIBg(int num) { return m_pUIBg[num]; }

private:
	static CNumber *m_apNumber[TIME_DIGITS];
	static CUIBg *m_pUIBg[TIME_DIGITS];
};

#endif